
const data = [
    "د.أبوبكر حسن علي بخيت ,استاذ مشارك,عميد الكلية",
    "أ.الزبير عوض السيد  محمد ,محاضر,المسجل",
    "أ.د.حسن  علي  الشايقي,استاذ,الدعوة والسيرة",
    "د.محمد عثمان محمد عبد الله ,استاذ مشارك,الدعوة والسيرة",
    "حامد محمد إدريس محمد ,استاذ مساعد,الدعوة والسيرة",
    "د.عماد محمد علي  أحمد,استاذ مساعد,الدعوة والسيرة",
    "د.عامر محمد علي رحمة,استاذ مساعد,الدعوة والسيرة",
    "أ.أحمد عبد الجليل الكاروري,محاضر,الدعوة والسيرة",
    "أ.محمد أبو عبيدة حسن,محاضر,الدعوة والسيرة",
    "أ.دالمرتضى الزين أحمد ,استاذ ,السنة وعلوم الحديث ",
    "د.اليسع محمد الحسن  ,استاذ مشارك,السنة وعلوم الحديث ",
    "د.إدريس علي الطيب علي  ,استاذ مشارك,السنة وعلوم الحديث ",
    "د.أبوبكر أسماعيل أحمد ,استاذ مساعد,السنة وعلوم الحديث ",
    "د.عصام عبد الله الضو,استاذ مساعد,السنة وعلوم الحديث ",
    "د.فاطمة الزاهراء أحمد عيسى,استاذ مساعد,السنة وعلوم الحديث ",
    "أناهيد  الطيب محمد ,استاذ مساعد,السنة وعلوم الحديث ",
    ".اسامة صالح محمد,متدرب,السنة وعلوم الحديث ",
    "د.عثمان محمد علي إبراهيم,استاذ مساعد,السنة وعلوم الحديث ",
    "أ.د.عبد الرافع حمد الأمين,استاذ,العقيدة والفكر الإسلامي ",
    "أ.د. أمين محمد سعيد الطاهر ,استاذ,العقيدة والفكر الإسلامي ",
    "د.خالد عبد اللطيف محمد نور,استاذ مشارك,العقيدة والفكر الإسلامي ",
    "د.عاصم محمد عوض الله الزين,استاذ مساعد,العقيدة والفكر الإسلامي ",
    "د.إدريس يعقوب الباشر نعيم,استاذ مساعد,العقيدة والفكر الإسلامي ",
    "د. فادية محمد أبو صالح ,استاذ مساعد,العقيدة والفكر الإسلامي ",
    "أ.تماضر أحمد محجوب محمد ,محاضر,العقيدة والفكر الإسلامي ",
    "أ.أميمة علوب محمد السيد,محاضر,العقيدة والفكر الإسلامي ",
    "أ.كيتا محمد ,محاضر متدرب,العقيدة والفكر الإسلامي"
]

console.log(data[0].split(",")[0])

// fetch("http://localhost:3300/api/post/lecturer", {
//     headers: {
//         'Accept': 'application/json',
//         'Content-Type': 'application/json',
//     },
//     method: "POST",
//     body: JSON.stringify({
//         "name": data[0].split(",")[0],
//         "specialization": data[0].split(",")[1],
//         "qualification": data[0].split(",")[2]
//     })
// }).then(res => {
//     console.log("Done")
//     console.log(res.data)
// }).catch(e => {
//     console.log("Error")
// })

data.forEach(async (dat, index) => {
    try {
        const res = await fetch("http://localhost:3300/api/post/lecturer", {
            headers: {
                'Accept': 'application/json',
                'Content-Type': 'application/json',
            },
            method: "POST",
            body: JSON.stringify({
                "name": dat.split(",")[0],
                "specialization": dat.split(",")[1],
                "qualification": dat.split(",")[2]
            })
        })
        const result = res.json()
        console.log("Done " + index)
        console.log(result.data)
    } catch (error) {
        console.log("Error")
    }
}
)
